{
    "architecture": {
        "title": {
            "ru": "Надёжность и стабильность архитектуры"
        },
        "description": {
            "ru": "JustB2B построен по современным стандартам программирования. Это означает высокую надёжность, стабильную работу и уверенность в том, что всё будет работать как надо — даже при большом количестве пользователей и товаров."
        },
        "features": {
            "singleton_trait": {
                "title": {
                    "ru": "Умная экономия ресурсов"
                },
                "description": {
                    "ru": "В плагине каждый важный компонент создаётся только один раз — это ускоряет работу сайта и снижает нагрузку на сервер. Всё работает быстро и без лишних затрат."
                },
                "order": 51
            }
        },
        "order": 50
    },
    "performance": {
        "title": {
            "ru": "Производительность и кэширование"
        },
        "description": {
            "ru": "JustB2B включает интеллектуальное кэширование значений во время выполнения, что снижает нагрузку на сервер и ускоряет генерацию цен и условий."
        },
        "features": {
            "runtime_cache": {
                "title": {
                    "ru": "Кэширование на лету (runtime cache)"
                },
                "description": {
                    "ru": "Ускоряет расчёты и снижает нагрузку на сервер за счёт сохранения промежуточных результатов — без записи в базу данных."
                },
                "order": 61
            }
        },
        "order": 60
    },
    "price_rules": {
        "title": {
            "ru": "Гибкие правила ценообразования"
        },
        "description": {
            "ru": "Модуль расчёта цен JustB2B поддерживает продвинутую логику: скидки и наценки на основе количества, ролей, групп, категорий, условий и приоритетов. Позволяет точно управлять B2B-ценами на уровне каждого товара."
        },
        "features": {
            "rule_engine": {
                "title": {
                    "ru": "Многоуровневая система расчёта цен"
                },
                "description": {
                    "ru": "Определяет цену товара в зависимости от правил: процентные и числовые скидки, наценки, установка фиксированной цены, с учётом нетто и брутто."
                },
                "order": 400
            },
            "net_gross_conversion": {
                "title": {
                    "ru": "Конвертация между нетто и брутто"
                },
                "description": {
                    "ru": "Автоматически пересчитывает цену с учётом налога — из брутто в нетто и обратно."
                },
                "order": 410
            },
            "flexible_sources": {
                "title": {
                    "ru": "Источники цен: WC или JustB2B"
                },
                "description": {
                    "ru": "Плагин поддерживает базовые цены как из WooCommerce, так и из собственных мета-полей JustB2B."
                },
                "order": 420
            },
            "rrp_support": {
                "title": {
                    "ru": "Поддержка рекомендуемой розничной цены (RRP)"
                },
                "description": {
                    "ru": "Вычисляет и отображает RRP-цену с поддержкой первичного и вторичного источника: если основной источник возвращает 0, используется резервный."
                },
                "order": 430
            },
            "tax_rate_detection": {
                "title": {
                    "ru": "Автоматическое определение налоговой ставки"
                },
                "description": {
                    "ru": "Учитывает налоговую ставку в зависимости от настроек магазина и местоположения покупателя."
                },
                "order": 440
            }
        },
        "order": 100
    },
    "user_context": {
        "title": {
            "ru": "Контекст клиента: B2B или B2C"
        },
        "description": {
            "ru": "JustB2B автоматически различает клиентов по типу (B2B или B2C) и использует это как основу для ценообразования и отображения товаров."
        },
        "features": {
            "model": {
                "title": {
                    "ru": "Идентификация клиента"
                },
                "description": {
                    "ru": "Плагин определяет, является ли пользователь B2B-клиентом, и на основе этого показывает нужные цены и товары."
                },
                "order": 151
            },
            "is_b2b": {
                "title": {
                    "ru": "Определение B2B-клиента"
                },
                "description": {
                    "ru": "Система понимает, когда пользователь относится к сегменту B2B, и применяет соответствующие правила и цены."
                },
                "order": 152
            }
        },
        "order": 150
    },
    "admin_rules": {
        "title": {
            "ru": "Удобное управление ценовыми правилами"
        },
        "description": {
            "ru": "Вы можете легко создавать и редактировать правила, которые автоматически изменяют цену в зависимости от роли клиента, количества, категории и других условий — без необходимости в коде."
        },
        "features": {
            "controller": {
                "title": {
                    "ru": "Всё под контролем — в одном месте"
                },
                "description": {
                    "ru": "Все ценовые правила собраны в удобной таблице в админке: редактируйте, фильтруйте, сортируйте."
                },
                "order": 201
            },
            "carbon_fields": {
                "title": {
                    "ru": "Конструктор ценовых правил"
                },
                "description": {
                    "ru": "Настройка занимает меньше минуты."
                },
                "order": 210
            }
        },
        "order": 200
    },
    "admin_roles": {
        "title": {
            "ru": "Гибкое управление ролями клиентов"
        },
        "description": {
            "ru": "Создавайте B2B-роли (например, «оптовик», «дилер») и назначайте их пользователям. Используйте роли как условия для цен и отображения товаров."
        },
        "features": {
            "role_model": {
                "title": {
                    "ru": "Связь пользователей с ролями"
                },
                "description": {
                    "ru": "Вы можете вручную привязывать пользователей к нужной роли — и эта роль будет использоваться при расчёте цен и отображении товаров."
                },
                "order": 221
            }
        },
        "order": 220
    },
    "product_visibility": {
        "title": {
            "ru": "Управление отображением и ценами товаров"
        },
        "description": {
            "ru": "JustB2B позволяет показывать каждому клиенту именно те товары и цены, которые вы хотите. Цены обновляются автоматически."
        },
        "features": {
            "controller": {
                "title": {
                    "ru": "Управление товарами без кода"
                },
                "description": {
                    "ru": "Плагин сам управляет отображением товаров, ценами, покупаемостью и видимостью в каталоге в зависимости от условий — вы просто задаёте правила."
                },
                "order": 301
            },
            "dynamic_price_display": {
                "title": {
                    "ru": "Цены, которые меняются в реальном времени"
                },
                "description": {
                    "ru": "JustB2B подменяет цены прямо на витрине WooCommerce в зависимости от роли пользователя, количества, правил и условий — без перезагрузки страницы."
                },
                "order": 310
            },
            "ajax_price_update": {
                "title": {
                    "ru": "Мгновенное обновление цены при изменении количества"
                },
                "description": {
                    "ru": "При смене количества товарной позиции цена пересчитывается моментально с помощью AJAX — клиент сразу видит свою цену."
                },
                "order": 320
            },
            "full_hiding": {
                "title": {
                    "ru": "Скрытие товаров полностью"
                },
                "description": {
                    "ru": "Если правило говорит «не показывать» — клиент даже не сможет открыть страницу товара. Абсолютный контроль над тем, кто что видит."
                },
                "order": 330
            },
            "request_price_mode": {
                "title": {
                    "ru": "Запрос цены вместо цифры"
                },
                "description": {
                    "ru": "Вы можете скрыть цену товара и заменить её надписью «Цена по запросу» — например, для эксклюзивных товаров или оптовых клиентов."
                },
                "order": 370
            },
            "hide_from_catalog": {
                "title": {
                    "ru": "Скрытие товаров из каталога"
                },
                "description": {
                    "ru": "Вы можете полностью скрыть определённые товары из каталога, виджетов и витрин — они не будут видны неподходящим клиентам."
                },
                "order": 380
            }
        },
        "order": 300
    },
    "product_logic": {
        "title": {
            "ru": "Умная логика товаров и цен"
        },
        "description": {
            "ru": "JustB2B анализирует условия, подбирает подходящие правила и точно рассчитывает цену для каждого товара и клиента. Всё автоматически."
        },
        "features": {
            "model": {
                "title": {
                    "ru": "Привязка условий и правил к товарам"
                },
                "description": {
                    "ru": "Каждый товар может участвовать в нескольких правилах одновременно. Плагин сам выбирает первое подходящее и применяет цену."
                },
                "order": 401
            },
            "rule_matching": {
                "title": {
                    "ru": "Автоматический подбор правил"
                },
                "description": {
                    "ru": "Плагин находит все правила, подходящие под товар, пользователя, категории, группы и другие условия — вам не нужно ничего связывать вручную."
                },
                "order": 410
            },
            "rule_priority": {
                "title": {
                    "ru": "Приоритет правил"
                },
                "description": {
                    "ru": "Если к товару подходит несколько правил, применяется то, что имеет наивысший приоритет и подходит по количеству."
                },
                "order": 420
            },
            "price_calculator": {
                "title": {
                    "ru": "Мгновенный пересчёт цены"
                },
                "description": {
                    "ru": "JustB2B рассчитывает цену в зависимости от условий и количества — с учётом скидок, наценок, базовых цен и налогов."
                },
                "order": 430
            },
            "price_display": {
                "title": {
                    "ru": "Отображение нужной цены нужному клиенту"
                },
                "description": {
                    "ru": "Клиент видит именно ту цену, которая для него рассчитана. Больше не нужно догадываться, почему цена отличается."
                },
                "order": 440
            }
        },
        "order": 400
    },
    "price_display": {
        "title": {
            "ru": "Отображение цен для B2B и B2C"
        },
        "description": {
            "ru": "Управляет отображением цен в зависимости от типа пользователя, правил, контекста (каталог или товар), с поддержкой HTML-шаблонов и таблиц количеств."
        },
        "features": {
            "conditional_visibility": {
                "title": {
                    "ru": "Условная видимость цен"
                },
                "description": {
                    "ru": "Позволяет настраивать отображение отдельных блоков цен (брутто, нетто, RRP) в зависимости от роли пользователя и контекста (каталог, карточка)."
                },
                "order": 510
            },
            "formatted_price_blocks": {
                "title": {
                    "ru": "Форматированные HTML-блоки цен"
                },
                "description": {
                    "ru": "Каждая цена оборачивается в стилизованные блоки с префиксами и постфиксами, заданными в настройках."
                },
                "order": 520
            },
            "quantity_table": {
                "title": {
                    "ru": "Таблица цен в зависимости от количества"
                },
                "description": {
                    "ru": "Отображает на фронтенде таблицу с правилами ценообразования по количеству, включая источник цены, приоритет и границы."
                },
                "order": 530
            },
            "dynamic_html": {
                "title": {
                    "ru": "Динамическое HTML-содержимое"
                },
                "description": {
                    "ru": "Позволяет отображать настраиваемый HTML под ценами на основе настроек администратора и роли пользователя."
                },
                "order": 540
            }
        },
        "order": 500
    },
    "settings_ui": {
        "title": {
            "ru": "Настройки отображения цен и шаблонов"
        },
        "description": {
            "ru": "Гибкие настройки отображения цен, шаблонов и пользовательских HTML-блоков без необходимости править код."
        },
        "features": {
            "net_gross_selector": {
                "title": {
                    "ru": "Настройка формата цен (нетто \/ брутто)"
                },
                "description": {
                    "ru": "Выберите, в каком формате (с НДС или без) будет рассчитываться базовая цена — для каждой группы цен отдельно."
                },
                "order": 601
            },
            "conditional_blocks": {
                "title": {
                    "ru": "Видимость блоков цен в каталоге и на карточке"
                },
                "description": {
                    "ru": "Управляйте, какие блоки цен отображаются и в каком контексте (каталог или карточка товара), отдельно для B2B и B2C."
                },
                "order": 610
            },
            "custom_html_blocks": {
                "title": {
                    "ru": "Кастомный HTML под ценами"
                },
                "description": {
                    "ru": "Отображайте любой HTML-блок под ценами (например, условия доставки или скидок) — отдельно для B2B и B2C клиентов."
                },
                "order": 630
            }
        },
        "order": 600
    },
    "cart_visibility": {
        "title": {
            "ru": "Настройки корзины для B2B и B2C"
        },
        "description": {
            "ru": "JustB2B позволяет настроить, какие цены (нетто или брутто) должны отображаться в мини-корзине — в зависимости от типа клиента."
        },
        "features": {
            "cart_model": {
                "title": {
                    "ru": "Гибкое отображение цен в мини-корзине"
                },
                "description": {
                    "ru": "Вы можете задать, кто видит нетто- и брутто-цены в мини-корзине: B2B, B2C или все. Это помогает соблюдать юридические и UX-требования."
                },
                "order": 601
            }
        },
        "order": 600
    },
    "payment_rules": {
        "title": {
            "ru": "Настройка платёжных методов"
        },
        "description": {
            "ru": "Управляйте доступностью способов оплаты в зависимости от типа клиента и суммы заказа — это повышает контроль, безопасность и UX."
        },
        "features": {
            "method_visibility": {
                "title": {
                    "ru": "Отображение методов оплаты по ролям и типу клиента"
                },
                "description": {
                    "ru": "Показывайте или скрывайте способы оплаты для B2B и B2C клиентов в зависимости от бизнес-логики и условий."
                },
                "order": 701
            },
            "method_conditions": {
                "title": {
                    "ru": "Условия отображения платёжного метода"
                },
                "description": {
                    "ru": "Метод оплаты будет доступен только если пользователь соответствует заданному типу (B2B\/B2C) и другим условиям."
                },
                "order": 702
            },
            "amount_limits": {
                "title": {
                    "ru": "Ограничения по сумме заказа"
                },
                "description": {
                    "ru": "Вы можете задать минимальные и максимальные суммы для каждого способа оплаты — это исключает ошибки и упрощает контроль."
                },
                "order": 703
            }
        },
        "order": 700
    },
    "shipping_ui": {
        "title": {
            "ru": "Настройка условий доставки для B2B и B2C"
        },
        "description": {
            "ru": "Позволяет управлять видимостью и условиями доставки в зависимости от типа пользователя и суммы заказа. Максимальная гибкость без необходимости писать код."
        },
        "features": {
            "method_visibility": {
                "title": {
                    "ru": "Управление доступностью методов доставки"
                },
                "description": {
                    "ru": "Метод доставки может отображаться только B2B, только B2C или всем пользователям — настройка производится через выпадающий список."
                },
                "order": 701
            },
            "free_shipping_threshold": {
                "title": {
                    "ru": "Бесплатная доставка от указанной суммы"
                },
                "description": {
                    "ru": "Можно задать минимальную сумму заказа (в нетто), от которой метод доставки становится бесплатным — отдельно для каждого метода."
                },
                "order": 710
            },
            "contextual_labels": {
                "title": {
                    "ru": "Информативные метки и зоны"
                },
                "description": {
                    "ru": "Название метода доставки включает зону и статус — администратор сразу видит, где и как он работает."
                },
                "order": 720
            }
        },
        "order": 700
    },
    "wcpt_integration": {
        "title": {
            "ru": "Интеграция с таблицами продуктов (WCPT)"
        },
        "description": {
            "ru": "JustB2B корректно работает с плагинами таблиц продуктов, такими как WooCommerce Product Table Lite\/Pro, заменяя цену на соответствующую B2B или B2C."
        },
        "features": {
            "correct_cart_total": {
                "title": {
                    "ru": "Корректный итог корзины в таблице"
                },
                "description": {
                    "ru": "В таблицах продуктов отображается итоговая сумма с учётом B2B- и B2C-логики: нетто или брутто, в зависимости от пользователя."
                },
                "order": 801
            },
            "user_type_based_total": {
                "title": {
                    "ru": "Учет типа пользователя (B2B \/ B2C)"
                },
                "description": {
                    "ru": "Итоговая сумма рассчитывается в зависимости от роли пользователя: B2B видят нетто, B2C — брутто."
                },
                "order": 802
            }
        },
        "order": 800
    },
    "theme_integration": {
        "title": {
            "ru": "Интеграция с темами и шаблонами"
        },
        "description": {
            "ru": "JustB2B автоматически адаптируется к WoodMart."
        },
        "features": {
            "woodmart_shipping_bar": {
                "title": {
                    "ru": "Поддержка индикатора доставки в теме WoodMart"
                },
                "description": {
                    "ru": "JustB2B подставляет правильную минимальную сумму для бесплатной доставки в прогресс-бар темы WoodMart, с учётом условий и логики B2B."
                },
                "order": 901
            }
        },
        "order": 900
    }
}